[
  "In a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Wess Roley, 20, is shown using flint to start a fire in Idaho.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, firefighters are depicted arriving at the scene of the wildfire.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley is shown shooting two firefighters fatally and injuring a third with a shotgun.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, law enforcement is engaging in a firefight with Roley as the wildfire rages in the background.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley's apparent suicide is portrayed on the screen.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley is found deceased on a mountain, with a firearm lying nearby.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Grandfather Dale Roley confirms Roley's employment at a tree company, indicating Roley acted alone in the incident.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley is seen expressing a desire to become a forest firefighter, despite the tragic turn of events.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley, who recently moved to Idaho, is shown working for a tree company before the incident.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, the narrative unfolds with Roley acting alone in the unfolding tragedy, leading to the devastating consequences for all involved.",
  "In a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Wess Roley, 20, is seen igniting a brush fire using a flint in the wilderness of Idaho.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, firefighters rush to the scene of the ignited brush fire, prepared to combat the growing blaze.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley coldly shoots two firefighters, resulting in fatal injuries to both of them.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, a third firefighter is injured by Roley's shotgun blast, adding to the chaos and tragedy of the situation.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, law enforcement officials address the public in a press conference, revealing the shocking details of Roley's fatal attacks on the firefighters.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley is depicted climbing a tall tree, using it as a vantage point to carry out his heinous attacks on the unsuspecting firefighters.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Roley finds himself in a tense firefight with law enforcement officers amidst the raging wildfire, leading to a climactic showdown.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, the scene unfolds dramatically as Roley appears to take his own life during the intense exchange of gunfire with law enforcement.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, despite his aspirations to join forest firefighting efforts, Roley is shown to have recently moved to Idaho, where the tragic events transpire.\n\nIn a flat 2D cartoon Pixar/Disney style with soft pastel colors and simple shapes, Grandfather Dale Roley confirms Roley's employment at a tree company, shedding light on his activities before the harrowing incident unfolded."
]