[
  "The man suspected of shooting two firefighters in Idaho, Wess Roley, is believed to have started a brush fire with a flint to lure them to the scene. He climbed a tree and shot the firefighters with a shotgun. Law enforcement officers engaged in a firefight with the suspect. His body was later found on a mountain with a firearm nearby, leading authorities to believe he died by suicide. Roley's grandfather mentioned he had wanted to become a forest firefighter and had recently moved to Idaho to work for a tree company.",
  "Wess Roley, the man suspected of shooting two firefighters in Idaho, is believed to have started a brush fire with a flint to lure them to the scene. Climbing a tree, he shot the firefighters with a shotgun. Law enforcement officers engaged in a firefight with him, and Roley's body was later found on a mountain with a firearm nearby, indicating he died by suicide. Roley had recently moved to Idaho to work for a tree company and had expressed interest in becoming a forest firefighter, according to his grandfather.",
  "In Idaho, a man named Wess Roley is suspected of shooting two firefighters who had responded to a brush fire that he started using a flint to lure them. Roley climbed a tree and shot the firefighters with a shotgun. Law enforcement officers engaged in a firefight with him. His body was later found on a mountain with a firearm nearby, indicating that he died by suicide. Roley had recently moved to Idaho to work for a tree company and had expressed interest in becoming a forest firefighter, according to his grandfather.",
  "The man suspected of shooting two firefighters in Idaho, identified as Wess Roley, is believed to have started a brush fire with a flint to lure the firefighters to the scene. Roley then climbed a tree and shot the firefighters with a shotgun. Law enforcement officers engaged in a firefight with him. Roley's body was later found on a mountain with a firearm nearby, indicating he died by suicide. His grandfather mentioned that Roley had recently moved to Idaho to work for a tree company and had expressed interest in becoming a forest firefighter.",
  "Wess Roley, a 20-year-old man suspected of shooting two firefighters in Idaho, allegedly started a brush fire with a flint to attract the firefighters. Climbing a tree, he shot them with a shotgun, leading to a firefight between him and law enforcement officers. Roley's body was later found on a mountain with a firearm nearby, indicating he died by suicide. His grandfather mentioned that Roley had recently moved to Idaho to work for a tree company and had aspirations of becoming a forest firefighter.",
  "Wess Roley, a 20-year-old man, is suspected of shooting two firefighters and injuring a third in Idaho. He allegedly used a flint to start a brush fire to lure the firefighters and then climbed a tree and shot them with a shotgun. Law enforcement officers engaged in a firefight with Roley while the wildfire burned. Roley's body was later found on a mountain with a firearm nearby, indicating he died by suicide. Roley had recently moved to Idaho to work for a tree company and had aspirations of becoming a forest firefighter, according to his grandfather."
]